<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 分页设置
    |--------------------------------------------------------------------------
    */

    'paginate' => [
        'limit' => 10,
    ],

    /*
    |--------------------------------------------------------------------------
    | 文章列表字数显示设置
    |--------------------------------------------------------------------------
    */

    'article' => [
        'limit' => 256,
        'hot_limit' => 5,
        'new_limit' => 5,
    ],

    /*
    |--------------------------------------------------------------------------
    | 邮件发送设置
    |--------------------------------------------------------------------------
    */

    'email' => [
        'limit' => 5,// 每天发送条数
        'timeout' => 1,// 间隔1分钟
        'error' => [
            'limit' => function($limit) {
                return '每天最多发送' . $limit . '条邮件!';
            },
            'timeout' => function($timeout) {
                return '请求过于频繁，请' . config('global.email.timeout') . '分钟后再试!';
            },
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | geetest验证码设置
    |--------------------------------------------------------------------------
    */

    'geetest' => [
        'captcha_id' => env('GEETEST_CAPTCHA_ID'),
        'private_key' => env('GEETEST_PRIVATE_KEY'),
    ],

    /*
    |--------------------------------------------------------------------------
    | oauth配置文件设置
    |--------------------------------------------------------------------------
    */

    'passport' => [
        'personal_access_client_id' => env('PASSPORT_PERSONAL_ACCESS_CLIENT_ID'),
        'personal_access_client_secret' => env('PASSPORT_PERSONAL_ACCESS_CLIENT_SECRET'),
        'grant_client_id' => env('PASSPORT_PASSWORD_GRANT_CLIENT_ID'),
        'grant_client_secret' => env('PASSPORT_PASSWORD_GRANT_CLIENT_SECRET'),
    ],
];